{
    "current_page": 1,
    "data": [
        {
            "fact": "A cat can sprint at about thirty-one miles per hour.",
            "length": 52
        },
        {
            "fact": "In ancient Egypt, when a family cat died, all family members would shave their eyebrows as a sign of mourning.",
            "length": 110
        },
        {
            "fact": "70% of your cat's life is spent asleep.",
            "length": 39
        },
        {
            "fact": "The richest cat is Blackie who was left £15 million by his owner, Ben Rea.",
            "length": 74
        },
        {
            "fact": "Most cats adore sardines.",
            "length": 25
        },
        {
            "fact": "When a domestic cat goes after mice, about 1 pounce in 3 results in a catch.",
            "length": 76
        },
        {
            "fact": "The name \"jaguar\" comes from a Native American word meaning \"he who kills with one leap\".",
            "length": 89
        },
        {
            "fact": "Cats have 32 muscles that control the outer ear (humans have only 6). A cat can independently rotate its ears 180 degrees.",
            "length": 122
        },
        {
            "fact": "Normal body temperature for a cat is 102 degrees F.",
            "length": 51
        },
        {
            "fact": "In Siam, the cat was so revered that one rode in a chariot at the head of a parade celebrating the new king.",
            "length": 108
        },
        {
            "fact": "A cat’s heart beats nearly twice as fast as a human heart, at 110 to 140 beats a minute.",
            "length": 88
        },
        {
            "fact": "Perhaps the most famous comic cat is the Cheshire Cat in Lewis Carroll’s Alice in Wonderland. With the ability to disappear, this mysterious character embodies the magic and sorcery historically associated with cats.",
            "length": 216
        },
        {
            "fact": "There are approximately 100 breeds of cat.",
            "length": 42
        },
        {
            "fact": "Of all the species of cats, the domestic cat is the only species able to hold its tail vertically while walking. All species of wild cats hold their tail horizontally or tucked between their legs while walking.",
            "length": 210
        },
        {
            "fact": "All cats have three sets of long hairs that are sensitive to pressure - whiskers, eyebrows,and the hairs between their paw pads.",
            "length": 128
        },
        {
            "fact": "In an average year, cat owners in the United States spend over $2 billion on cat food.",
            "length": 86
        },
        {
            "fact": "The most popular pedigreed cat is the Persian cat, followed by the Main Coon cat and the Siamese cat.",
            "length": 101
        },
        {
            "fact": "The largest cat breed is the Ragdoll. Male Ragdolls weigh between 12 and 20 lbs (5.4-9.0 k). Females weigh between 10 and 15 lbs (4.5-6.8 k).",
            "length": 141
        },
        {
            "fact": "Florence Nightingale owned more than 60 cats in her lifetime.",
            "length": 61
        },
        {
            "fact": "Cats can judge within 3 inches the precise location of a sound being made 1 yard away.",
            "length": 86
        },
        {
            "fact": "Cats have 3 eyelids.",
            "length": 20
        },
        {
            "fact": "When a cat chases its prey, it keeps its head level. Dogs and humans bob their heads up and down.",
            "length": 97
        },
        {
            "fact": "Cat families usually play best in even numbers. Cats and kittens should be acquired in pairs whenever possible.",
            "length": 111
        },
        {
            "fact": "Cat paws act as tempetature regulators, shock absorbers, hunting and grooming tools, sensors, and more",
            "length": 102
        },
        {
            "fact": "Cats eat grass to aid their digestion and to help them get rid of any fur in their stomachs.",
            "length": 92
        },
        {
            "fact": "Cats have supersonic hearing",
            "length": 28
        },
        {
            "fact": "Owning a cat is actually proven to be beneficial for your health.",
            "length": 65
        },
        {
            "fact": "The Pilgrims were the first to introduce cats to North America.",
            "length": 63
        },
        {
            "fact": "Cats should not be fed tuna exclusively, as it lacks taurine, an essential nutrient required for good feline health.  Make sure you have the proper Pet supplies to keep your cat happy and healthy.",
            "length": 196
        },
        {
            "fact": "A cat lover is called an Ailurophilia (Greek: cat+lover).",
            "length": 57
        },
        {
            "fact": "There is a species of cat smaller than the average housecat. It is native to Africa and it is the Black-footed cat (Felis nigripes). Its top weight is 5.5 pounds.",
            "length": 162
        },
        {
            "fact": "Cats only sweat through their paws and nowhere else on their body",
            "length": 65
        },
        {
            "fact": "Neutering a cat extends its life span by two or three years.",
            "length": 60
        },
        {
            "fact": "In one stride, a cheetah can cover 23 to 26 feet (7 to 8 meters).",
            "length": 65
        },
        {
            "fact": "Cats are extremely sensitive to vibrations. Cats are said to detect earthquake tremors 10 or 15 minutes before humans can.",
            "length": 122
        },
        {
            "fact": "According to a Gallup poll, most American pet owners obtain their cats by adopting strays.",
            "length": 90
        },
        {
            "fact": "Smuggling a cat out of ancient Egypt was punishable by death. Phoenician traders eventually succeeded in smuggling felines, which they sold to rich people in Athens and other important cities.",
            "length": 192
        },
        {
            "fact": "Cats have 30 vertebrae (humans have 33 vertebrae during early development; 26 after the sacral and coccygeal regions fuse)",
            "length": 122
        },
        {
            "fact": "Cats prefer to remain non-confrontational. They will not fight to show dominance, but rather to stake their territory. Cats will actually go to extremes to avoid one another in order to prevent a possible confrontation.",
            "length": 219
        },
        {
            "fact": "In Ancient Egypt, when a person's house cat passed away, the owner would shave their eyebrows to reflect their grief.",
            "length": 117
        },
        {
            "fact": "Sir Isaac Newton is credited with creating the concept for the pet door that many cats use today to travel outdoors.",
            "length": 116
        },
        {
            "fact": "A female cat is called a queen or a molly.",
            "length": 42
        },
        {
            "fact": "Kittens who are taken along on short, trouble-free car trips to town tend to make good passengers when they get older. They get used to the sounds and motions of traveling and make less connection between the car and the visits to the vet.",
            "length": 239
        },
        {
            "fact": "A kitten will typically weigh about 3 ounces at birth.  The typical male housecat will weigh between  7 and 9 pounds, slightly less for female housecats.",
            "length": 153
        },
        {
            "fact": "In relation to their body size, cats have the largest eyes of any mammal.",
            "length": 73
        },
        {
            "fact": "A cat will tremble or shiver when it is in extreme pain.",
            "length": 56
        },
        {
            "fact": "A cat can travel at a top speed of approximately 31 mph (49 km) over a short distance.",
            "length": 86
        },
        {
            "fact": "The average cat can jump 8 feet in a single bound, nearly six times its body length!",
            "length": 83
        },
        {
            "fact": "Polydactyl cats (a cat with 1-2 extra toes on their paws) have this as a result of a genetic mutation. These cats are also referred to as 'Hemingway cats' because writer Ernest Hemingway reportedly owned dozens of them at his home in Key West, Florida.",
            "length": 252
        },
        {
            "fact": "Cats are subject to gum disease and to dental caries. They should have their teeth cleaned by the vet or the cat dentist once a year.",
            "length": 133
        }
    ],
    "first_page_url": "https://catfact.ninja/facts?page=1",
    "from": 1,
    "last_page": 7,
    "last_page_url": "https://catfact.ninja/facts?page=7",
    "next_page_url": "https://catfact.ninja/facts?page=2",
    "path": "https://catfact.ninja/facts",
    "per_page": "50",
    "prev_page_url": null,
    "to": 50,
    "total": 332
}